---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowBox
source: html/8ade0b39-c454-57d2-092a-f699da8db55f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowBox Property

"Show Box"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportAttrShowBox { get; }
```